SFD_FLAMELET_JETTURB_PILTURB/system/controlDict_template
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoReactingFoam;

startFrom       @STARTTIME@;

startTime       0.0;

stopAt          endTime;

endTime         @ENDTIME@;

deltaT          @DELTAT@;

writeControl    adjustableRunTime;

writeInterval   @WRITEINTERVAL@;

purgeWrite      0;

writeFormat     @WRITEFORMAT@;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep   no;

maxCo           0.4;

functions
{
    fieldAverage1
    {
        type            fieldAverage;
        functionObjectLibs ( "libfieldFunctionObjects.so" );
        enabled         @ENABLED@;
        outputControl   outputTime;
        resetOnRestart  @RESTART@;
        resetOnOutput   @RESTARTOUT@;
#include "average.inc"
    }
}


// ************************************************************************* //

